Public Attributes | List of all members
API_CWJunctionQuantity Struct Reference
Element Manager API
Describes the different calculated values for curtain wall junctions. More...
#include <APIdefs_Elements.h>
 Public Attributes
GS::uchar_t  | typeText [API_UniLongNameLen]
Name of the GDL object.
double  | filler [8]
Reserved for later use.
Detailed Description
Describes the different calculated values for curtain wall junctions.
Remarks
See also the curtain wall junction parameters for listing in Appendix A of the GDL Reference manual. API 21 removed those quantities (width, height, length) that were never calculated.
Member Data Documentation
◆ filler
 API_CWJunctionQuantity::filler
Reserved for later use.
◆ typeText
 API_CWJunctionQuantity::typeText
Name of the GDL object.